// Задача 1. Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

let arr1 = ['a', 'b', 'c'];
let arr2 = [1, 2, 3];

let arr = arr1.concat(arr2);
console.log(arr);

// Задача 2. Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

let arr = ['a', 'b', 'c'];
arr.push(1, 2, 3);

console.log(arr);

// Задача 3. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

let arr = [1, 2, 3];
arr.reverse();

console.log(arr);

// Задача 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

let arr = [1, 2, 3];
arr.unshift(4, 5, 6);

console.log(arr);

// Задача 5. Дан массив ['js', 'css', 'react']. Выведите на экран последний элемент.

let arr = ['js', 'css', 'react'];
let arr2 = arr.pop();
console.log(arr2);

// Задача 6. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый массив элементы [4, 5].

let arr = [1, 2, 3, 4, 5];
let arr2 = arr.slice(3, 2);

console.log(arr2);

// Задача 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

let arr = [1, 2, 3, 4, 5];
arr.splice(1, 2);

console.log(arr);

// Задача 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

let arr = [1, 2, 3, 4, 5];
let arr2 = arr.splice(1, 3);

console.log(arr2);

// Задача 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

let arr = [1, 2, 3, 4, 5];
arr.splice(3, 0, 'a', 'b', 'c');

console.log(arr);

// Задача 10. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

let arr = [3, 4, 1, 2, 7];
arr.sort();

console.log(arr);

// Задача 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. 

let arr = [1, 2, 3, 4, 5];
arr.splice(1, 0, 'a', 'b');
arr.splice(6, 0, 'c');
arr.splice(8, 0, 'e');
console.log(arr);